rec1/index.html
<!DOCTYPE html>
<html>
<head>
<!-- 2016-04-21 Thu 15:07 -->
<meta  charset="utf-8">
<meta  name="viewport" content="width=device-width, initial-scale=1">
<title>Recursividad: práctica 1</title>
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Dato Simó">
<link rel="stylesheet" type="text/css" href="/prog2/org.css">
</head>
<body>
<div id="content">
<h1 class="title">Recursividad: práctica 1</h1>
<div id="table-of-contents">
<h2>&Iacute;ndice</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">Función <i>sumar</i> recursiva</a>
<ul>
<li><a href="#orgheadline2">Caso base y caso recursivo</a></li>
<li><a href="#orgheadline3">Recursividad con arreglo por copia</a>
<ul>
<li><a href="#orgheadline4">Función <i>sumarRec()</i></a></li>
</ul>
</li>
<li><a href="#orgheadline5">Recursividad con arreglo por índice</a>
<ul>
<li><a href="#orgheadline6">Función <i>sumarRec1()</i></a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">Función <i>sumar</i> recursiva</h2>
<div class="outline-text-2" id="text-orgheadline1">
<p>
<b>Archivo de código:</b> <a href="SumarRec.java">SumarRec.java</a>.
</p>

<p>
Se desea implementar una función recursiva que sume todos los elementos de un
arreglo de enteros:
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #859900;">static</span> <span style="color: #b58900;">int</span> <span style="color: #268bd2;">sumar</span>(<span style="color: #b58900;">int</span> <span style="color: #268bd2;">arr</span>[]);
</pre>
</div>

<p>
Como referencia, esta sería la implementación iterativa, con complejidad
\(\mathcal{O}(n)\).
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75;">Versi&#243;n iterativa de sumar().</span>
<span style="color: #859900;">static</span> <span style="color: #b58900;">int</span> <span style="color: #268bd2;">sumarIter</span>(<span style="color: #b58900;">int</span> <span style="color: #268bd2;">arr</span>[]) {
    <span style="color: #b58900;">int</span> <span style="color: #268bd2;">suma</span> = 0;

    <span style="color: #859900;">for</span> (<span style="color: #b58900;">int</span> <span style="color: #268bd2;">i</span>=0; i &lt; arr.<span style="color: #b58900;">length</span>; i++)
        suma = suma + arr[i];

    <span style="color: #859900;">return</span> suma;
}
</pre>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2">Caso base y caso recursivo</h3>
<div class="outline-text-3" id="text-orgheadline2">
<p>
Para pensar la función recursiva, hay que determinar el <i>caso base</i> y el <i>caso
recursivo</i>.
</p>

<p>
La pregunta para descubrir el caso base es:
</p>

<blockquote>
<p>
<b>Caso base:</b> ¿cuál es el <i>tamaño mínimo</i> del problema (esto es, el tamaño mínimo
del arreglo) para el cual se puede dar una solución <i>inmediata?</i>
</p>
</blockquote>

<p>
Y la pregunta para descubrir el caso recursivo:
</p>

<blockquote>
<p>
<b>Caso recursivo:</b> si la función <i>ya supiera</i> sumar arreglos de longitud \(N\) ¿qué
debería hacer para sumar un arreglo de longitud \(N+1\)?
</p>
</blockquote>

<p>
Las respuestas para el caso de la suma son:
</p>

<ul class="org-ul">
<li><p>
<b>Caso base:</b> se puede dar una solución inmediata si <span class="underline">el arreglo es de tamaño
1</span>, ya que: la suma de un arreglo con un solo elemento es, directamente, ese
elemento:
</p>

<pre class="example">
suma([7]) = 7
suma([3]) = 3
suma([0]) = 0
suma([-1]) = -1
</pre></li>

<li><p>
<b>Caso recursivo:</b> si sumar un arreglo de, por ejemplo, tres elementos (\(N =
    3\)) ya es <i>un caso resuelto</i>, se puede dar una solución a un arreglo de \(N +
    1 = 4\) <span class="underline">agregando al primer elemento la suma de los tres restantes</span>:
</p>

<pre class="example">
suma([7, 3, 9, 5])  =  7 + suma([3, 9, 5])
</pre></li>
</ul>
</div>
</div>


<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3">Recursividad con arreglo por copia</h3>
<div class="outline-text-3" id="text-orgheadline3">
<p>
El código del caso base de la suma es trivial:
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75;">Caso base solamente.</span>
<span style="color: #859900;">static</span> <span style="color: #b58900;">int</span> <span style="color: #268bd2;">sumarRec</span>(<span style="color: #b58900;">int</span> <span style="color: #268bd2;">arr</span>[]) {
    <span style="color: #859900;">if</span> (arr.length == 1) {
        <span style="color: #859900;">return</span> arr[0];
    }
}
</pre>
</div>

<p>
Para el caso recursivo se debe implementar el “achicamiento” del problema. En
otras palabras, implementar:
</p>

<pre class="example">
// Pseudo-código del caso recursivo
if arreglo.length &gt; 1:
    return arreglo[0] + sumarRec("mismo arreglo sin el primer elemento");
</pre>

<p>
Por ejemplo:
</p>

<pre class="example">
// Pseudo-código con un arreglo de ejemplo
arreglo = [7, 3, 9, 5];
if arreglo.length &gt; 1:
    return arreglo[0] + sumarRec([3, 9, 5]);
</pre>

<p>
En Java, para pasar de <code>[7, 3, 9, 5]</code> a <code>[3, 9, 5]</code> es necesario realizar una copia
del arreglo, pues no se pueden eliminar elementos.
</p>

<p>
Se podría implementar la siguiente función auxiliar:
</p>

<p>
<a id="orgtarget1"></a>
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75;">Devuelve una copia del arreglo sin su primer elemento.</span>
<span style="color: #859900;">static</span> <span style="color: #b58900;">int</span>[] <span style="color: #268bd2;">borrarPrimero</span>(<span style="color: #b58900;">int</span> <span style="color: #268bd2;">arreglo</span>[]) {
    <span style="color: #859900;">return</span> <span style="color: #268bd2; font-weight: bold;">null</span>;
}
</pre>
</div>

<p>
Con esta función, el pseudo-código quedaría tal que:
</p>

<pre class="example">
// Pseudo-código usando borrarPrimero().
arreglo = [7, 3, 9, 5];
if arreglo.length &gt; 1:
    return arreglo[0] + sumarRec(borrarPrimero(arreglo));
                                 ^^^^^^^^^^^^^^^^^^^^^^
</pre>
</div>

<div id="outline-container-orgheadline4" class="outline-4">
<h4 id="orgheadline4">Función <i>sumarRec()</i></h4>
<div class="outline-text-4" id="text-orgheadline4">
<p>
La versión final de <code>sumarRec()</code> sería:
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #859900;">static</span> <span style="color: #b58900;">int</span> <span style="color: #268bd2;">sumarRec</span>(<span style="color: #b58900;">int</span> <span style="color: #268bd2;">arr</span>[]) {
    <span style="color: #859900;">if</span> (arr.length == 1) {
        <span style="color: #859900;">return</span> arr[0];
    }
    <span style="color: #859900;">if</span> (arr.length &gt; 1) {
      <span style="color: #859900;">return</span> arr[0] + sumarRec(borrarPrimero(arr));
    }
    <span style="color: #859900;">return</span> 0;  <span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75;">En caso de que nos pasen un arreglo vac&#237;o.</span>
}
</pre>
</div>

<p>
Una traza de su ejecución sería:
</p>

<pre class="example">
sumarRec([7, 3, 9, 5])
7 + sumarRec([3, 9, 5])
7 + 3 + sumarRec([9, 5])
7 + 3 + 9 + sumarRec([5])
7 + 3 + 9 + 5
7 + 3 + 14
7 + 17
24
</pre>

<p>
<b>Ejercicio 1</b>: implementar <a href="#orgtarget1">borrarPrimero()</a>.
</p>
</div>
</div>
</div>


<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5">Recursividad con arreglo por índice</h3>
<div class="outline-text-3" id="text-orgheadline5">
<p>
La complejidad de copiar un arreglo es \(\mathcal{O}(n)\) y no cambia aunque se
descarte el primer elemento. El problema de realizar una copia en cada paso de
la recursión es que la complejidad total de <i>sumarRec</i> se dispara a
\(\mathcal{O}(n^2)\).
</p>

<p>
Para mantener la complejidad de la solución recursiva en \(\mathcal{O}(n)\) se
debe evitar realizar copia alguna del arreglo.
</p>

<p>
El patrón recursivo para solucionar este problema es sustituir la copia del
arreglo por un parámetro <i>posición</i> que indica cuál es la siguiente posición a
sumar.
</p>

<p>
Un ejemplo sería:
</p>

<pre class="example">
// Pseudo-código para la recursión por índice:

sumarRec1([7, 3, 9, 5]) =

  arr[0] + sumarRec1("mismo arreglo, pero a partir del índice 1")
                                          ^^^^^^^^^^^^^^^^^^^^^

sumarRec1([7, 3, 9, 5], "a partir del índice 1") =

  arr[1] + sumarRec1("mismo arreglo a partir del índice 2")
                                    ^^^^^^^^^^^^^^^^^^^^^

sumarRec1([7, 3, 9, 5], "a partir del índice 2") =

  arr[2] + sumarRec1("mismo arreglo a partir del índice 3")
                                    ^^^^^^^^^^^^^^^^^^^^^

sumarRec1([7, 3, 9, 5], "a partir del índice 3") =

  → 3 es el úlimo índice, no hay llamada recursiva
    ^^^^^^^^^^^^^^^^^^^^

  return arr[3];
</pre>

<p>
Ahora, por tanto, la función recursiva toma dos parámetros:
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #859900;">static</span> <span style="color: #b58900;">int</span> <span style="color: #268bd2;">sumarRec1</span>(<span style="color: #b58900;">int</span> <span style="color: #268bd2;">arr</span>[], <span style="color: #b58900;">int</span> <span style="color: #268bd2;">pos</span>);
</pre>
</div>

<ul class="org-ul">
<li><b>Caso base:</b> si <i>pos</i> es el último índice válido, se devuelve directamente
<code>arr[pos]</code>.</li>

<li><b>Caso recursivo:</b> si no, se achica el problema incrementando en 1 el índice.</li>
</ul>

<p>
El código sería:
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #859900;">static</span> <span style="color: #b58900;">int</span> <span style="color: #268bd2;">sumarRec1</span>(<span style="color: #b58900;">int</span> <span style="color: #268bd2;">arr</span>[], <span style="color: #b58900;">int</span> <span style="color: #268bd2;">pos</span>) {
    <span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75;">Caso base: pos es el &#250;ltimo &#237;ndice del arreglo.</span>
    <span style="color: #859900;">if</span> (pos == arr.length - 1) {
        <span style="color: #859900;">return</span> arr[pos];
    }
    <span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75;">Caso recursivo: incrementar &#237;ndice en 1.</span>
    <span style="color: #859900;">return</span> arr[pos] + sumarRec1(arr, pos + 1);
}
</pre>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-4">
<h4 id="orgheadline6">Función <i>sumarRec1()</i></h4>
<div class="outline-text-4" id="text-orgheadline6">
<p>
La firma de la función original que se pidió es:
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #859900;">static</span> <span style="color: #b58900;">int</span> <span style="color: #268bd2;">sumar</span>(<span style="color: #b58900;">int</span> <span style="color: #268bd2;">arr</span>[]);
</pre>
</div>

<p>
Sin embargo, la función <i>sumarRec1</i> no cumple con esta firma, pues toma un
parámetro adicional.
</p>

<p>
La solución es mover el código recursivo a una función auxiliar privada:
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #859900;">private</span> <span style="color: #859900;">static</span> <span style="color: #b58900;">int</span> <span style="color: #268bd2;">sumarAux1</span>(<span style="color: #b58900;">int</span> <span style="color: #268bd2;">arr</span>[], <span style="color: #b58900;">int</span> <span style="color: #268bd2;">pos</span>) {
    <span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75;">Caso base: pos es el &#250;ltimo &#237;ndice del arreglo.</span>
    <span style="color: #859900;">if</span> (pos == arr.length - 1) {
        <span style="color: #859900;">return</span> arr[pos];
    }
    <span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75;">Caso recursivo: incrementar &#237;ndice en 1.</span>
    <span style="color: #859900;">return</span> arr[pos] + sumarAux1(arr, pos + 1);
}
</pre>
</div>

<p>
Y dejar a <i>sumarRec1</i> llamar a la función auxiliar, comenzando a sumar por el
primer elemento (índice 0):
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #859900;">static</span> <span style="color: #b58900;">int</span> <span style="color: #268bd2;">sumarRec1</span>(<span style="color: #b58900;">int</span> <span style="color: #268bd2;">arr</span>[]) {
    <span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75;">Manejar primero el caso de un arreglo vac&#237;o.</span>
    <span style="color: #859900;">if</span> (arr.length == 0) {
        <span style="color: #859900;">return</span> 0;
    }
    <span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75;">Llamada a la funci&#243;n auxiliar recursiva.</span>
    <span style="color: #859900;">return</span> sumarAux1(arr, 0);
}
</pre>
</div>

<p>
Una traza de su ejecución sería:
</p>

<pre class="example">
sumarRec1([7, 3, 9, 5])
sumarAux1([7, 3, 9, 5], 0)
                        ⬆
7 + sumarAux1([7, 3, 9, 5], 1)
                            ⬆
7 + 3 + sumarAux1([7, 3, 9, 5], 2)
                                ⬆
7 + 3 + 9 sumarRec([7, 3, 9, 5], 3)
                                 ⬆
7 + 3 + 9 + 5
7 + 3 + 14
7 + 17
24
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
